---
kind: other
id: Methods.T:Autodesk.Revit.DB.ViewNavigationToolSettings
source: html/571b82dc-1746-dc58-ea5e-c866e4f57f7d.htm
---
# ViewNavigationToolSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.